package gr.metaptixiako.forumergasia;


//Εδώ απλά τρέχουν όλα τα ερωτήματα που αποθηκεύονται στην βάση σε κάθε πίνακα. Είναι ερωτήματα που συνδέονται
//με την σελίδα ForumActivity.java

public class QueryInsert {

    String queryforums,querytopics,queryposts;
    public String QueryInsertForums(){

        queryforums = "INSERT INTO forums (name , parent_id ) VALUES ('Smartphones',1),('Tablets',2)," +
                "('Gadgets',3);";


        return queryforums;

    }

    public String QueryInsertTopics(){

        querytopics = "INSERT INTO topics (name , parent_id ) VALUES " +
                "('LG V30s: Με βελτιωμένη κάμερα με ΑΙ στο MWC 2018;',1)," +
                "('LG: Πατέντα για σχέδιο smartphone που διπλώνει στα τρία',1)," +
                "('LG: Δύσκολες ώρες, αποσύρει τα smartphones της από την Κινέζικη αγορά;',1)," +
                "('Apple: Μέσα στο 2018 η φθηνότερη έκδοση iPad που έχουμε δει;',2)," +
                "('DJI Mavic Air: Αποκτήστε το πιο φορητό DJI drone 3 αξόνων',3);";


        return querytopics;

    }
    public String QueryInsertPosts(){

        queryposts = "INSERT INTO posts (text , parent_id , author_id ) VALUES " +
                "('Το LG V30s, μια αναβαθμισμένη έκδοση του LG V30 λέγεται ότι θα λανσάρει" +
                " η εταιρεία στο πλαίσιο του MWC 2018." +
                "Τα παραπάνω αναφέρει το PhoneRadar επικαλούμενο δημοσίευμα του ETNews. Το LG " +
                "V30s θα έχει τον ίδιο σχεδιασμό με το LG V30 αλλά θα έχει νέες λειτουργίες ΑΙ" +
                " στην κάμερά του, παρόμοια με το Google Lens στο Pixel 2 ή το Bixby Vision στο Samsung Galaxy S8." +
                "Σύμφωνα με τις πληροφορίες, η κάμερα του LG V30s Θα μπορεί να αναγνωρίζει προϊόντα " +
                "και να παρέχει links ή παρόμοιες προτάσεις, να πραγματοποιεί σάρωση QR κωδικών ή " +
                "κωδικών προϊόντων και να μεταφράζει γραπτό κείμενο.',1,1)," +
                "('Όταν το smartphone θα είναι ημιδιπλωμένο, μια διαφορετική λειτουργία θα είναι " +
                "ενεργοποιημένη. Στην κατάσταση αυτή, η τρίτη οθόνη θα διαχωρίζεται από τις άλλες" +
                " δύο. Έτσι, ο χρήστης θα μπορεί να βλέπει άλλο περιεχόμενο στη μία οθόνη (τη μικρότερη) " +
                "κι άλλο στη μεγαλύτερη (που θα έχει το μέγεθος δύο οθονών)." +
                "Τέλος, η LG φαίνεται ότι αν και αρχικά έχει σκεφτεί την πατέντα για smartphones, " +
                "δεν αποκλείεται να την χρησιμοποιήσει (αν τελικά υλοποιηθεί) και σε άλλες συσκευής " +
                "όπως τάμπλετ, φορητές συσκευές πλοήγησης, προσωπικό ψηφιακό βοηθό και άλλες παρόμοιες " +
                "συσκευές.',2,1),('Είναι γνωστό πως τα τελευταία χρόνια η LG " +
                "δεν έχει σημειώσει ιδιαίτερες επιτυχίες στην αγορά κινητών τηλεφώνων. Οι συσκευές που" +
                " παρουσιάζει αποτυγχάνουν να κινήσουν το ενδιαφέρον, οδηγώντας σε αισθητά μειωμένα έσοδα." +
                "Δυστυχώς, φαίνεται πως ο Κορεάτης κατασκευαστής βρίσκεται σε εξαιρετικά δύσκολη θέση." +
                " Μερικές ημέρες μετά την ανακοίνωση των οικονομικών αποτελεσμάτων του για το 2017, " +
                "όπου το τελευταίο τρίμηνο υπήρξε… κενό 192 εκατομμυρίων δολαρίων εξαιτίας του τμήματος κινητής τηλεφωνίας, μια νέα πληροφορία έρχεται να αναταράξει" +
                " ακόμα περισσότερο την εμπιστοσύνη των καταναλωτών στην LG που συνεχώς κλυδωνίζεται." +
                " Συγκεκριμένα, η εταιρεία φαίνεται να αποσύρει επίσημα τα smartphones της από την αγορά " +
                "της Κίνας, με τον ανταγωνισμό από τους εγχώριους κατασκευαστές να είναι ο κύριος υπεύθυνος." +
                "Αν συλλογιστεί κανείς πως το 2016 στην Κίνα απεστάλησαν 480 εκατομμύρια κινητές συσκευές," +
                " εκ των οποίων μόλις οι… 160 χιλιάδες (περίπου) έφεραν το brand name της LG, είναι προφανές πως η εταιρεία" +
                " δεν έχει καμία θέση στην συγκεκριμένη αγορά. Μπορεί κανείς να θεωρήσει πως η Κίνα είναι μια μακρινή χώρα της " +
                "οποίας τα στατιστικά δεν αφορούν την υπόλοιπη υφήλιο, όμως πρόκειται για μια κολοσσιαία αγορά που… ανεβάζει και κατεβάζει " +
                "ολόκληρες επιχειρήσεις-γίγαντες. Ας ελπίσουμε πως η LG θα σταθεί στα πόδια της σύντομα, γιατί προς το παρόν φαίνεται να συνεχίζει',3,1)," +
                "('Η Apple φημίζεται για την υψηλή τιμολογιακή πολιτική που ακολουθεί και εφαρμόζει στα προϊόντα της εδώ και χρόνια. Για παράδειγμα, το" +
                " επετειακό" +
                " smartphone της εταιρείας, iPhone X, έχει προκαλέσει ποικίλες αντιδράσεις με την τιμή των 1200 ευρώ (τουλάχιστον) που ζητάει από τους καταναλωτές." +
                "Το Cupertino διαθέτει μια ευρεία γκάμα από tablets, ξεκινώντας με το iPad Mini 4ης γενιάς, προχωρώντας στο iPad 9.7 ιντσών και καταλήγοντας στα iPad " +
                "Pro 10.5″ / 12.9″. Ο επίσημος ιστότοπος της Apple διαθέτει, ως φθηνότερο μοντέλο, το απλό iPad με χωρητικότητα 32GB στα 329 δολάρια.',4,1)," +
                "('Εκτός από οριζόντιες, κάθετες και 180° panoramas λήψεις, το DJI Mavic Air μπορεί να ενώσει μέχρι 25 φωτογραφίες σε μόλις 8 δευτερόλεπτα, έτσι ώστε να δημιουργήσετε σφαιρικό πανόραμα ανάλυσης 32MP. Για μια πιο ζωντανή εμπειρία, απολαύστε τις φωτογραφίες μέσα από τα DJI Goggles.\n" +
                "Ο νέος προηγμένος HDR αλγόριθμος της κάμερας εξασφαλίζει τις σωστές ρυθμίσεις έκθεσης με έξυπνο τρόπο βάσει των συνθηκών φωτισμού. Για παράδειγμα, οι σκοτεινές περιοχές, επεξεργάζονται με τέτοιο τρόπο ώστε η μετάβαση μεταξύ φωτεινών και πιο σκοτεινών σημείων να είναι πιο φυσική.',5,1);";


        return queryposts;

    }

}
