package gr.metaptixiako.forumergasia;


//Εδώ απλά τρέχουν όλα τα ερωτήματα που αποθηκεύονται στην βάση σε κάθε πίνακα. Είναι ερωτήματα που συνδέονται
//με την σελίδα ForumActivity.java

public class QueryInsert {

    String queryforums,querytopics,queryposts;
    public String QueryInsertForums(){

        queryforums = "INSERT INTO forums (name , parent_id ) VALUES ('Smartphones',1),('Tablets',2)," +
                "('Gadgets',3);";


        return queryforums;

    }

    public String QueryInsertTopics(){

        querytopics = "INSERT INTO topics (name , parent_id ) VALUES " +
                "('LG V30s: Με βελτιωμένη κάμερα με ΑΙ στο MWC 2018;',1)," +
                "('LG: Πατέντα για σχέδιο smartphone που διπλώνει στα τρία',1),('LG: Δύσκολες ώρες, αποσύρει τα smartphones της από την Κινέζικη αγορά;',1)," +
                "('Samsung Galaxy S9: Μάλλον θα έχει μικρότερη αναλογία οθόνης-σώματος από το S8',1)," +
                "('Samsung Galaxy S8 / S8+: Ξεκίνησε η αναβάθμιση σε Android 8.0 Oreo σε Ευρώπη',1)," +
                "('Apple: Μέσα στο 2018 η φθηνότερη έκδοση iPad που έχουμε δει;',2),('DJI Mavic Air: Αποκτήστε το πιο φορητό DJI drone 3 αξόνων',3);";


        return querytopics;

    }
    public String QueryInsertPosts(){

        queryposts = "INSERT INTO posts (text , parent_id , author_id ) VALUES " +
                "('Το LG V30s, μια αναβαθμισμένη έκδοση του LG V30 λέγεται ότι θα λανσάρει" +
                " η εταιρεία στο πλαίσιο του MWC 2018.\n" +
                "Τα παραπάνω αναφέρει το PhoneRadar επικαλούμενο δημοσίευμα του ETNews. Το LG " +
                "V30s θα έχει τον ίδιο σχεδιασμό με το LG V30 αλλά θα έχει νέες λειτουργίες ΑΙ" +
                " στην κάμερά του, παρόμοια με το Google Lens στο Pixel 2 ή το Bixby Vision στο Samsung Galaxy S8." +
                "Σύμφωνα με τις πληροφορίες, η κάμερα του LG V30s Θα μπορεί να αναγνωρίζει προϊόντα " +
                "και να παρέχει links ή παρόμοιες προτάσεις, να πραγματοποιεί σάρωση QR κωδικών ή " +
                "κωδικών προϊόντων και να μεταφράζει γραπτό κείμενο.',1,1)," +
                "('Όταν το smartphone θα είναι ημιδιπλωμένο, μια διαφορετική λειτουργία θα είναι " +
                "ενεργοποιημένη. Στην κατάσταση αυτή, η τρίτη οθόνη θα διαχωρίζεται από τις άλλες" +
                " δύο. Έτσι, ο χρήστης θα μπορεί να βλέπει άλλο περιεχόμενο στη μία οθόνη (τη μικρότερη) " +
                "κι άλλο στη μεγαλύτερη (που θα έχει το μέγεθος δύο οθονών)." +
                "Τέλος, η LG φαίνεται ότι αν και αρχικά έχει σκεφτεί την πατέντα για smartphones, " +
                "δεν αποκλείεται να την χρησιμοποιήσει (αν τελικά υλοποιηθεί) και σε άλλες συσκευής " +
                "όπως τάμπλετ, φορητές συσκευές πλοήγησης, προσωπικό ψηφιακό βοηθό και άλλες παρόμοιες " +
                "συσκευές.',2,1),('Είναι γνωστό πως τα τελευταία χρόνια η LG " +
                "δεν έχει σημειώσει ιδιαίτερες επιτυχίες στην αγορά κινητών τηλεφώνων. Οι συσκευές που" +
                " παρουσιάζει αποτυγχάνουν να κινήσουν το ενδιαφέρον, οδηγώντας σε αισθητά μειωμένα έσοδα." +
                "Δυστυχώς, φαίνεται πως ο Κορεάτης κατασκευαστής βρίσκεται σε εξαιρετικά δύσκολη θέση." +
                " Μερικές ημέρες μετά την ανακοίνωση των οικονομικών αποτελεσμάτων του για το 2017, " +
                "όπου το τελευταίο τρίμηνο υπήρξε… κενό 192 εκατομμυρίων δολαρίων εξαιτίας του τμήματος κινητής τηλεφωνίας, μια νέα πληροφορία έρχεται να αναταράξει" +
                " ακόμα περισσότερο την εμπιστοσύνη των καταναλωτών στην LG που συνεχώς κλυδωνίζεται." +
                " Συγκεκριμένα, η εταιρεία φαίνεται να αποσύρει επίσημα τα smartphones της από την αγορά " +
                "της Κίνας, με τον ανταγωνισμό από τους εγχώριους κατασκευαστές να είναι ο κύριος υπεύθυνος." +
                "Αν συλλογιστεί κανείς πως το 2016 στην Κίνα απεστάλησαν 480 εκατομμύρια κινητές συσκευές," +
                " εκ των οποίων μόλις οι… 160 χιλιάδες (περίπου) έφεραν το brand name της LG, είναι προφανές πως η εταιρεία δεν έχει καμία θέση στην συγκεκριμένη αγορά. Μπορεί κανείς να θεωρήσει πως η Κίνα είναι μια μακρινή χώρα της οποίας τα στατιστικά δεν αφορούν την υπόλοιπη υφήλιο, όμως πρόκειται για μια κολοσσιαία αγορά που… ανεβάζει και κατεβάζει ολόκληρες επιχειρήσεις-γίγαντες. Ας ελπίσουμε πως η LG θα σταθεί στα πόδια της σύντομα, γιατί προς το παρόν φαίνεται να συνεχίζει',3,1),('Η Apple φημίζεται για την υψηλή τιμολογιακή πολιτική που ακολουθεί και εφαρμόζει στα προϊόντα της εδώ και χρόνια. Για παράδειγμα, το επετειακό smartphone της εταιρείας, iPhone X, έχει προκαλέσει ποικίλες αντιδράσεις με την τιμή των 1200 ευρώ (τουλάχιστον) που ζητάει από τους καταναλωτές.\n" +
                "Το Cupertino διαθέτει μια ευρεία γκάμα από tablets, ξεκινώντας με το iPad Mini 4ης γενιάς," +
                " προχωρώντας στο iPad 9.7 ιντσών και καταλήγοντας στα iPad Pro 10.5″ / 12.9″. Ο επίσημος" +
                " ιστότοπος της Apple διαθέτει, ως φθηνότερο μοντέλο, το απλό iPad με χωρητικότητα 32GB " +
                "στα 329 δολάρια. Ακολουθεί το iPad Mini με 399 δολάρια, ενώ φτάνουμε μέχρι τα 1150 δολάρια " +
                "του iPad Pro 12.9 ιντσών, την έκδοση με 512GB ελεύθερο χώρο. Η αλήθεια είναι πως τα $329 " +
                "είναι μια τσιμπημένη, αλλά σχετικά καλή τιμή για τα χαρακτηριστικά, την ποιοτική κατασκευή" +
                " και την συνολική απόδοση του iPad 9.7″.',3,1),('Τη δυνατότητα να αποκτήσετε το DJI Mavic " +
                "Air και την Fly More Combo έκδοσή του, με έκπτωση, χωρίς έξοδα αποστολής και τα τέλη " +
                "εκτελωνισμού πληρωμένα δίνει το ηλεκτρονικό κατάστημα Tomtop.\n" +
                "To DJI Mavic Air αποτελεί ένα υπερφορητό κι αναδιπλούμενο drone με gimbal τριών αξόνων." +
                " Με βάρος μόλις 430 γραμμάρια, το DJI Mavic Air ενσωματώνει όλες τις χαρακτηριστικές" +
                " τεχνολογίες της DJI, εξασφαλίζοντας high-end επιδόσεις και λειτουργικότητα για απεριόριστη εξερεύνηση.\n" +
                "Χαρακτηριστικό του DJI Mavic Air, είναι ότι αποτελεί το πιο φορητό drone της DJI με μηχανικό " +
                "gimbal τριών αξόνων. Σε συνδυασμό με τον αισθητήρα 12MP CMOS 1/2.3” με φακό 24mm f/2.8 της κάμερας, " +
                "μπορείτε να απολαμβάνετε καθαρές εικόνες και να πραγματοποιείτε λήψη βίντεο σε ανάλυση 4K στα 30 " +
                "fps και βίντεο σε slow motion ανάλυσης 1080p στα 120fps. Έτσι, καμία λεπτομέρεια από τις περιπέτειές " +
                "σας δεν θα σας ξεφύγει.',4,1),('Τα Samsung Galaxy S9 και S9+ θα ανακοινωθούν σύντομα και συγκεκριμένα " +
                "την Κυριακή 25 Φεβρουαρίου. Μαζί με τις νέες high-end συσκευές θα επισημοποιηθεί το ανανεωμένο DeX " +
                "gadget που θα μετατρέπει το Galaxy κινητό σας σε… κανονικό ηλεκτρονικό υπολογιστή\n" +
                "Πριν από λίγες ώρες, ο γνωστός leaker Evan Blass (@evleaks) ανήρτησε στον προσωπικό του " +
                "Twitter λογαριασμό δύο εικόνες-renders που αποκαλύπτουν τον σχεδιασμό του νέου αξεσουάρ, " +
                "το οποίο μάλιστα θα ονομάζεται “DeX Pad”. Σε αυτό θα τοποθετείται η συσκευή με την πλάτη " +
                "προς τα κάτω και όχι κάθετα (όπως στο προηγούμενο DeX μοντέλο), ώστε ο χρήστης να είναι σε " +
                "θέση να χειριστεί το panel ως επιφάνεια αφής για διάφορες λειτουργίες (πχ. μετακίνηση του " +
                "κέρσορα). Από πλευρά συνδεσμολογίας, το DeX Pad έχει δύο θύρες USB, μία Type-C και επίσης " +
                "μια για καλώδιο HDMI. Η Samsung αφαίρεσε την υποδοχή Ethernet, αλλά η πλειοψηφία των καταναλωτών " +
                "δεν θα το παρατηρήσει καν.\n" +
                "Εκτός απροόπτου, το DeX Pad θα κάνει την παρθενική του εμφάνιση στο κοινό " +
                "ταυτόχρονα με τα Galaxy S9/S9+, όπως προαναφέρθηκε. Στο μέλλον θα φανεί αν " +
                "το συγκεκριμένο αξεσουάρ έχει μια θέση στην αγορά, ή η ιδέα της μετατροπής του " +
                "smartphone σε υπολογιστή δεν είναι ώριμη ακόμα για να καρποφορήσει. Όπως και να " +
                "έχει, πρόκειται σίγουρα για ένα ωραίο gadget που θα “δώσει” επιπλέον λειτουργίες " +
                "στην ναυαρχίδα σας.',5,1);";


        return queryposts;

    }

}
